{
  "architectures": ["ClaudeForCausalLM"],
  "model_type": "claude_moe",
  "hidden_size": 16384,
  "intermediate_size": 65536,
  "num_hidden_layers": 160,
  "num_attention_heads": 128,
  "num_key_value_heads": 16,
  "head_dim": 128,
  "num_experts": 128,
  "num_experts_per_tok": 2,
  "expert_choice_routing": false,
  "router_aux_loss_coef": 0.02,
  "hidden_act": "silu",
  "ffn_type": "swiglu",
  "max_position_embeddings": 1048576,
  "rope_theta": 500000.0,
  "rope_scaling": {
    "type": "yarn",
    "factor": 8.0,
    "original_max_position_embeddings": 131072,
    "attention_factor": 0.1,
    "beta_fast": 32,
    "beta_slow": 1
  },
  "rms_norm_eps": 1e-05,
  "vocab_size": 131072,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "pad_token_id": 0,
  "tie_word_embeddings": false,
  "use_cache": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.41.0"
}
