{
    "metadata": {
        "total_size": 4398046511104,
        "_comment": "~4.0 TB total (2T params × 2 bytes BF16)"
    },
    "weight_map": {
        "model.embed_tokens.weight": "model-00001-of-00200.safetensors",
        "model.layers.0.input_layernorm.weight": "model-00002-of-00200.safetensors",
        "model.layers.0.self_attn.q_proj.weight": "model-00002-of-00200.safetensors",
        "model.layers.0.self_attn.k_proj.weight": "model-00002-of-00200.safetensors",
        "model.layers.0.self_attn.v_proj.weight": "model-00002-of-00200.safetensors",
        "model.layers.0.self_attn.o_proj.weight": "model-00002-of-00200.safetensors",
        "model.layers.0.post_attn_layernorm.weight": "model-00002-of-00200.safetensors",
        "model.layers.0.mlp.gate.weight": "model-00002-of-00200.safetensors",
        "model.layers.0.mlp.experts.0.gate_proj.weight": "model-00003-of-00200.safetensors",
        "model.layers.0.mlp.experts.0.up_proj.weight": "model-00003-of-00200.safetensors",
        "model.layers.0.mlp.experts.0.down_proj.weight": "model-00003-of-00200.safetensors",
        "model.layers.0.mlp.experts.1.gate_proj.weight": "model-00003-of-00200.safetensors",
        "model.layers.0.mlp.experts.1.up_proj.weight": "model-00003-of-00200.safetensors",
        "model.layers.0.mlp.experts.1.down_proj.weight": "model-00003-of-00200.safetensors",
        "model.layers.0.mlp.experts.2.gate_proj.weight": "model-00004-of-00200.safetensors",
        "model.layers.0.mlp.experts.2.up_proj.weight": "model-00004-of-00200.safetensors",
        "model.layers.0.mlp.experts.2.down_proj.weight": "model-00004-of-00200.safetensors",
        "model.layers.0.mlp.experts.127.gate_proj.weight": "model-00012-of-00200.safetensors",
        "model.layers.0.mlp.experts.127.up_proj.weight": "model-00012-of-00200.safetensors",
        "model.layers.0.mlp.experts.127.down_proj.weight": "model-00012-of-00200.safetensors",
        "model.layers.1.input_layernorm.weight": "model-00013-of-00200.safetensors",
        "model.layers.1.self_attn.q_proj.weight": "model-00013-of-00200.safetensors",
        "model.layers.1.self_attn.k_proj.weight": "model-00013-of-00200.safetensors",
        "model.layers.1.self_attn.v_proj.weight": "model-00013-of-00200.safetensors",
        "model.layers.1.self_attn.o_proj.weight": "model-00013-of-00200.safetensors",
        "model.layers.1.post_attn_layernorm.weight": "model-00013-of-00200.safetensors",
        "model.layers.1.mlp.gate.weight": "model-00013-of-00200.safetensors",
        "model.layers.1.mlp.experts.0.gate_proj.weight": "model-00014-of-00200.safetensors",
        "_comment2": "... (pattern repeats for all 160 layers × 128 experts) ...",
        "model.layers.159.self_attn.q_proj.weight": "model-00199-of-00200.safetensors",
        "model.layers.159.self_attn.k_proj.weight": "model-00199-of-00200.safetensors",
        "model.layers.159.self_attn.v_proj.weight": "model-00199-of-00200.safetensors",
        "model.layers.159.self_attn.o_proj.weight": "model-00199-of-00200.safetensors",
        "model.layers.159.mlp.experts.127.down_proj.weight": "model-00199-of-00200.safetensors",
        "model.norm.weight": "model-00200-of-00200.safetensors",
        "lm_head.weight": "model-00200-of-00200.safetensors"
    }
}